minutes = int(input('Укажите количество минут: '))
hour = minutes // 60
remainder = minutes % 60
print(minutes, 'мин - это', hour, 'час', remainder, 'мин')

